chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* 螢幕關著時停在這裡。回傳 false 代表卡片被拔掉。 */
static bool wait_screen_on(void)
{
    while (!screen_poll()) {
        watchdog_feed();
        if (!sd_present()) {
            return false;
        }
        nap(100);
    }
    return true;
}

/* 判斷觸控是短按還是長按。回傳 0=沒碰到，1=短按，2=長按。
 *
 * 短按暫停／繼續、長按回選單。原本短按就直接離開，結果想停下來看某一張時
 * 只能被踢回選單，反而看不到。 */


/* 暫停 / 繼續的視覺回饋。
 *
 * 按鍵操作沒有觸覺以外的回饋，使用者按下去看畫面沒變會不確定有沒有成功。
 * 在畫面中央閃一個圖示一秒再還原 —— 蓋住的區域先備份，還原後照片完整。 */
#define ICON_SZ     140
#define ICON_SAVE   ((uint16_t *)0x91F00000u)   /* 140x140x2 = 39KB */

/* 圖示置中的位置。畫布尺寸隨方向改變，所以不能是常數。 */
static int icon_x(void) { return (gfx_width()  - ICON_SZ) / 2; }
static int icon_y(void) { return (gfx_height() - ICON_SZ) / 2; }

static void icon_backup(bool restore)
{
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int       ix = icon_x(), iy = icon_y();

    /* 兩種方向下「哪個軸在實體記憶體裡連續」剛好相反：
     *   直立：邏輯 x 是實體列，所以沿著邏輯 y 走才連續
     *   橫向：畫布與面板同向，沿著邏輯 x 走就連續
     * 兩者都是每次搬 ICON_SZ 個連續像素，只差基底怎麼算。 */
    for (uint32_t i = 0; i < ICON_SZ; i++) {
        uint16_t *fb;
        uint16_t *sv = ICON_SAVE + i * ICON_SZ;

        if (gfx_is_landscape()) {
            fb = front + (uint32_t)(iy + (int)i) * PHYS_W + (uint32_t)ix;
        } else {
            fb = front + (uint32_t)(gfx_width() - 1 - (ix + (int)i)) * PHYS_W
                       + (uint32_t)iy;
        }
        if (restore) {
            memcpy(fb, sv, ICON_SZ * sizeof(uint16_t));
        } else {
            memcpy(sv, fb, ICON_SZ * sizeof(uint16_t));
        }
    }
}

static void flash_icon(bool paused)
{
    uint16_t *back  = gfx_framebuffer();
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int cx = gfx_width()  / 2;
    int cy = gfx_height() / 2;
    int ICON_X = icon_x(), ICON_Y = icon_y();

    icon_backup(false);
    gfx_set_framebuffer(front);

    /* 半透明底：把區域壓暗，圖示才浮得出來。 */
    for (int j = 0; j < ICON_SZ; j++) {
        for (int i = 0; i < ICON_SZ; i++) {
            uint16_t v = gfx_get_pixel(ICON_X + i, ICON_Y + j);
            gfx_pixel(ICON_X + i, ICON_Y + j,
                      (uint16_t)((((v >> 11) & 0x1Fu) >> 1) << 11 |
                                 (((v >> 5) & 0x3Fu) >> 1) << 5 |
                                 ((v & 0x1Fu) >> 1)));
        }
    }

    if (paused) {
        gfx_fill_rect(cx - 30, cy - 36, 20, 72, COL_TEXT);   /* ▮▮ */
        gfx_fill_rect(cx + 10, cy - 36, 20, 72, COL_TEXT);
    } else {
        /* ▶：逐列畫，寬度隨高度線性收斂 */
        for (int j = 0; j < 72; j++) {
            int half = (j < 36) ? j : (71 - j);
            gfx_fill_rect(cx - 24, cy - 36 + j, 12 + half, 1, COL_TEXT);
        }
    }

    gfx_set_framebuffer(back);
    nap(1000);
    icon_backup(true);
}

/* 切換方向時閃一下目前的模式。
 *
 * 三段循環沒有回饋的話使用者不知道自己切到哪了 —— 沿用暫停圖示那套
 * 「壓暗背景、蓋上內容、一秒後還原」的機制。 */
static void flash_orient(void)
{
    uint16_t *back  = gfx_framebuffer();
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int cx = gfx_width() / 2;
    int cy = gfx_height() / 2;
    int ix = icon_x(), iy = icon_y();

    icon_backup(false);
    gfx_set_framebuffer(front);

    for (int j = 0; j < ICON_SZ; j++) {
        for (int i = 0; i < ICON_SZ; i++) {
            uint16_t v = gfx_get_pixel(ix + i, iy + j);
            gfx_pixel(ix + i, iy + j,
                      (uint16_t)((((v >> 11) & 0x1Fu) >> 1) << 11 |
                                 (((v >> 5) & 0x3Fu) >> 1) << 5 |
                                 ((v & 0x1Fu) >> 1)));
        }
    }
    gfx_text_center(cx, cy - 10, ORIENT_NAME[photo_get_orientation()],
                    COL_TEXT);

    gfx_set_framebuffer(back);
    nap(1000);
    icon_backup(true);
}

/* 暫停中的滑動判定。
 * 邏輯座標：x 是橫向（0~479），y 是縱向（0~799，往下遞增）。
 * 縱向門檻設得比橫向大，因為畫面高是寬的 1.67 倍，手滑起來也比較長。 */
#define SWIPE_MIN_X  60
#define SWIPE_MIN_Y  120
#define SWIPE_GAP_MS 150u   /* 容忍觸控中途漏報多久 */

/* 暫停：畫面停在目前這張。按鍵控制暫停/選單，滑動翻頁。 */
#define PAUSE_RESUME 0
#define PAUSE_MENU   1
#define PAUSE_PREV   2
#define PAUSE_NEXT   3
#define PAUSE_ROTATE 4

static int paused_loop(void)
{
    g_paused    = 1u;
    g_req_pause = 0u;               /* 消化掉進來的那一次 */
    flash_icon(true);

    for (;;) {
        int x0, y0;

        watchdog_feed();
        if (!sd_present()) {
            g_req_pause = 0u;
            g_paused    = 0u;
            return PAUSE_MENU;
        }
        if (g_req_pause) {
            g_req_pause = 0u;
            g_paused    = 0u;
            flash_icon(false);
            return PAUSE_RESUME;
        }

        /* 暫停中用滑動操作。
         *
         * 這塊板子只有一顆 USER 鍵，三段手勢已經吃掉亮度/暫停/選單，再塞
         * 翻頁只會變成沒人記得住的組合技。滑動是相簿的通用手勢，判定區是
         * 整個螢幕 —— 比先前那排小按鈕好按得多。
         *
         *   往左滑  下一張      往右滑  上一張      往下滑  回選單
         *
         * 取「位移較大的那個軸」判斷方向，避免斜著滑時兩種動作互搶。 */
        if (read_touch(&x0, &y0)) {
            int      x, y, dx = 0, dy = 0;
            uint32_t t0   = HAL_GetTick();
            uint32_t seen = t0;

            g_dbg_touch_hit++;

            /* 取「整段過程中的最大位移」，而不是放開瞬間的位置。
             *
             * 而且要容忍中途漏報：觸控控制器在手指快速移動時會掉幾筆，
             * 一讀不到就結束的話，位移只算到中斷點為止 —— 橫向滑動通常
             * 比較快，所以特別容易被截斷（實測往下滑慢而長就沒事）。 */
            for (;;) {
                uint32_t now = HAL_GetTick();

                watchdog_feed();
                if (read_touch(&x, &y)) {
                    int cx = x - x0;
                    int cy = y - y0;

                    seen = now;
                    if (((cx < 0) ? -cx : cx) > ((dx < 0) ? -dx : dx)) {
                        dx = cx;
                    }
                    if (((cy < 0) ? -cy : cy) > ((dy < 0) ? -dy : dy)) {
                        dy = cy;
                    }
                } else if (now - seen > SWIPE_GAP_MS) {
                    break;              /* 真的放開了 */
                }
                if (now - t0 > 2000u) {
                    break;              /* 按著不放就不算滑動 */
                }
                nap(10);
            }

            g_dbg_swipe_dx = dx;
            g_dbg_swipe_dy = dy;

            /* 取位移較大的那個軸，避免斜著滑時兩種動作互搶。 */
            {
                int ax = (dx < 0) ? -dx : dx;
                int ay = (dy < 0) ? -dy : dy;

                if (ay >= SWIPE_MIN_Y && ay > ax && dy > 0) {
                    g_paused = 0u;
                    return PAUSE_MENU;      /* 往下滑：回選單 */
                }
                if (ay >= SWIPE_MIN_Y && ay > ax && dy < 0) {
                    /* 往上滑：方向循環（直立 -> 橫向 -> 自動）。
                     * 按鍵已經被短按/長按佔滿，再加第三種時間長度手指
                     * 拿捏不出來（board-notes 14.4），所以走手勢。 */
                    return PAUSE_ROTATE;
                }
                if (ax >= SWIPE_MIN_X && ax > ay) {
                    g_paused = 0u;
                    return (dx < 0) ? PAUSE_NEXT : PAUSE_PREV;
                }
            }
        }
        nap(30);
    }
}


/* 等目前這張照片的展示時間走完。
 *
 * already_ms 是「這張已經在螢幕上待了多久」—— 也就是解下一張花掉的時間。
 * 解碼期間前一張本來就在螢幕上，那段時間當然要算進展示時間裡，否則使用者
 * 設 2 秒會變成「解碼 1.5 秒 + 等 2 秒 = 3.5 秒」，設定值和實際對不上。
 *
 * 回傳 0 = 正常等完，1 = 要離開播放，2 = 卡片被拔掉，
 *     3 = 暫停中按了上一張，4 = 下一張。 */
static int wait_interval(uint32_t already_ms)
{
    uint32_t wait_ms = g_interval_s * 1000u;
    uint32_t waited  = (already_ms > wait_ms) ? wait_ms : already_ms;
    uint32_t last    = HAL_GetTick();

    while (waited < wait_ms) {
        uint32_t now;

        watchdog_feed();
        if (!sd_present()) {
            return 2;
        }
        if (!screen_poll()) {
            /* 亮度 0（螢幕關著）：不累計時間，再點亮時這張還有完整時間。 */
            nap(100);
            last = HAL_GetTick();
            continue;
        }

        now = HAL_GetTick();
        waited += now - last;
        last = now;

        if (g_req_pause) {
            return 3;               /* 交給 slideshow 統一處理暫停 */
        }
        nap(15);
    }
    return 0;
}

/* 暫停期間的互動，含翻頁。
 *
 * 翻頁之後要「留在暫停」，所以這裡是個迴圈：paused_loop() 回報翻頁就解碼
 * 並顯示，然後再進 paused_loop() 等下一個指令，直到使用者要繼續或回選單。
 *
 * 先前這段邏輯散在 wait_interval 和 slideshow 兩處，而 wait_interval 只判斷
 * 「是不是回選單」，翻頁的回傳值被當成沒事發生 —— 症狀就是滑動翻了頁卻
 * 立刻自動繼續播放。集中在一個地方就不會再漏。
 *
 * *cur 進來是目前顯示的索引，出去是最後顯示的那張。
 * 回傳 0 = 繼續播放，1 = 回選單。 */
static int pause_session(int32_t *cur)
{
    for (;;) {
        int a = paused_loop();
        int dir;
        uint32_t target, tries;
        photo_result_t r;

        if (a == PAUSE_MENU) {
            return 1;
        }
        if (a == PAUSE_RESUME) {
            return 0;
        }
        if (a == PAUSE_ROTATE) {
            photo_set_orientation((photo_orient_t)
                (((uint32_t)photo_get_orientation() + 1u) % PHOTO_ORIENT_COUNT));
            /* 重畫目前這張，讓使用者當場看到新方向的結果。 */
            if (*cur >= 0 &&
                photo_show(PLAYLIST_BASE + g_order[*cur] * PATH_MAX)
                    == PHOTO_OK) {
                present();
            }
            flash_orient();
            continue;
        }

        /* 翻頁：往指定方向找一張解得開的，最多繞一圈。 */
        dir    = (a == PAUSE_PREV) ? -1 : 1;
        target = (uint32_t)((*cur < 0) ? 0 : *cur);
        tries  = 0;
        r      = PHOTO_ERR_READ;

        while (tries < g_order_count) {
            watchdog_feed();
            target = (target + g_order_count + (uint32_t)dir) % g_order_count;
            r = photo_show(PLAYLIST_BASE + g_order[target] * PATH_MAX);
            tries++;
            if (r == PHOTO_OK || r == PHOTO_ABORTED) {
                break;
            }
            g_decode_fail++;
        }
        if (r == PHOTO_OK) {
            present();
            *cur = (int32_t)target;
            g_decode_ok++;
        }
    }
}

/* 播放。
 *
 * 解碼與顯示重疊：目前這張在螢幕上的時候，就先把下一張解進另一塊 buffer，
 * 時間到直接切換。這樣換頁是瞬間的，而且間隔設定值就是實際的展示時間 ——
 * 只要解碼比間隔快。解碼比間隔慢的話，展示時間就等於解碼時間，沒辦法更快。 */
static void slideshow(void)
{
    uint32_t pos = 0;           /* 下一張要解碼的 g_order 索引 */
    int32_t  cur = -1;          /* 顯示中的索引，-1 = 還沒顯示過 */

    wait_release();

